customSolvers/edcSimpleFoam/run/flameD_PaSR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/dc/OpenFOAM/dc-1.5/run/";
    case "smootCase2";
    instance "system";
    local "";

    class dictionary;
    object controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2;
deltaT          1e-5;
writeControl    adjustableRunTime;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
graphFormat     xmgr;
runTimeModifiable yes;
functions       ( );
application     my_rhoSimpleFoam;
adjustTimeStep  on;
maxCo           0.4;

// ************************************************************************* //::
