customSolvers/edcSimpleFoam/run/flameD_PaSR/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
//        type fixedMeanValue;
//        meanValue       1.e5;
//        value           uniform 1.e5;
    }
    inletPilot
    {
        type            zeroGradient;
    }
    inletAir
    {
        type            zeroGradient;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    inletCH4
    {
        type            zeroGradient;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
