customSolvers/edcSimpleFoam/run/flameD_PaSR/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 0.1098;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    inletCH4
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
